## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to import, 10 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * module.darts-dets.azurerm_key_vault_secret.subuser-api-key
  * module.darts-dets.sendgrid_api_key.subuser
  * module.darts-dets.sendgrid_domain_authentication.domain-authenticate[&#34;mail-darts-dets-prod.platform.hmcts.net&#34;]
  * module.darts-dets-dns.azurerm_dns_cname_record.record1[&#34;mail-darts-dets-prod.platform.hmcts.net&#34;]
  * module.darts-dets-dns.azurerm_dns_cname_record.record2[&#34;mail-darts-dets-prod.platform.hmcts.net&#34;]
  * module.darts-dets-dns.azurerm_dns_cname_record.record3[&#34;mail-darts-dets-prod.platform.hmcts.net&#34;]
* Update
  * module.darts-dets.sendgrid_subuser.user
* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]
* Import
  * module.darts-dets.sendgrid_subuser.user




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.darts-dets.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-darts-dets-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.darts-dets.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "darts-dets-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.darts-dets.sendgrid_domain_authentication.domain-authenticate["mail-darts-dets-prod.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-darts-dets-prod.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.darts-dets.sendgrid_subuser.user will be updated in-place
  # (imported from "hmcts-darts-dets-prod")
  ~ resource "sendgrid_subuser" "user" {
        disabled = false
        email    = "DTSPlatformOps@HMCTS.NET"
        id       = "hmcts-darts-dets-prod"
      + ips      = [
          + "167.89.74.8",
        ]
      + password = (sensitive value)
        user_id  = 44409032
      + username = "hmcts-darts-dets-prod"
    }

  # module.darts-dets-dns.azurerm_dns_cname_record.record1["mail-darts-dets-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.darts-dets-dns.azurerm_dns_cname_record.record2["mail-darts-dets-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.darts-dets-dns.azurerm_dns_cname_record.record3["mail-darts-dets-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "prd" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "prd.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "prd2.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702743.wl244.sendgrid.net"
              - host  = "em5195.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "21552595" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em5195" -> (known after apply)
      ~ username             = "hmcts-pcol-prod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "prd._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd._domainkey" -> (known after apply)
      ~ name                = "prd._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "prd.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "prd2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd2._domainkey" -> (known after apply)
      ~ name                = "prd2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "prd2.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em5195.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em5195" -> (known after apply)
      ~ name                = "em5195" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 1 to import, 10 to add, 1 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":74,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->